# GetKnotsU Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NurbsSurfaceData..::..GetKnotsU Method
NurbsSurfaceData Class See Also
---
Get the list of knots in the u-direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<double> GetKnotsU()
```

Visual Basic
---
```text
Public Function GetKnotsU As IList(Of Double)
```

Visual C++
---
```text
public:
IList<double>^ GetKnotsU()
```

# See Also
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace